
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_storage_blob.b2c_login_html


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_login_html must be replaced
-/+ resource "azurerm_storage_blob" "b2c_login_html" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "9d31c8be82d017671e25bf23c5747d2d" -> "86c2c010d227f9fd6bf3a38b7ec82f09" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.html"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.109.148",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":726,"Program":"tfcmt","SHA1":"","Vars":{}} -->